{"/blog/i-failed-at-game-dev-in-my-20s-now-what/":{"data":{"":"“Videogames are the sum total of every expressive medium of all times. Made interactive!” - Phil Fish","a-foot-in-the-door#A Foot in the Door":"After my studies ended, I found a job as a QA tester in the only AAA studio here in Italy. It felt really strange to have finally reached my goals. I felt… almost empty. But anyway, the idea was to get a foot in the door.\nMy next goal was to get hired as an artist. But after talking with the senior artists there and doing some internal interviews, I realized that I wasn’t ready yet. My portfolio wasn’t enough. After six months, I left the studio to start studying online and improving my skills.","discovering-godot#Discovering Godot":"During that time, I also discovered Godot and completely fell in love with it. I started sharing my work online and developed a small following interested in Blender and Godot.\nI was primarily working with one other person, a coder, and eventually, we split from that company to start our own. Our idea was to make VR and web applications for businesses, and eventually invest the money we earned into a big game project.\nThis is when something really big happened…","going-all-in#Going All In":"We wanted to make games. And so we did! We invested our remaining money into a multiplayer game made in Godot. Aaand… it flopped.\nWe wanted to make too much in too little time, and the scope of the project was too big for our budget. We drained all our money, reached a state of complete burnout, and were forced to:\nPublish an unfinished product. Split up as a team. Find “real” jobs.","going-off-track#Going Off Track":"In the following year, I worked in advertising, did some VFX for a documentary, and eventually ended up working as an artist doing VR development in Unity for a medium-sized company. I did that for a couple of years and learned a lot about optimization.","something-felt-off#Something Felt Off\u0026hellip;":"Eventually, after a year of studying, I got good enough to land a job as a game environment artist. But something felt off. We were making games, so why were my colleagues so depressed?\nI worked in that studio for six months. It made me realize that this wasn’t what I was looking for. Being an artist on a team meant that my contribution to the final product was tiny. This wasn’t scratching the itch for me, and after six months, I left to work as a freelance 3D artist.","the-calling-of-games#The Calling of Games":"I discovered game development when I was a teenager and it quickly became a bit of an obsession, so I set a goal for myself: I was going to become a game developer. When the time came to choose a university, I decided to study game development.\nI spent a year at a game development school. Before starting, we had to choose if we wanted to study art, coding, or game design. I was artistically inclined, so I chose art.\nI wasn’t really happy that I had to choose, but that choice defined my future; I started to see myself as a game artist.","the-lawsuit#The Lawsuit":"A client threatened a lawsuit against us to force us to work for free. We had to spend a lot of money to defend ourselves but ended up reaching an agreement.\nIt was the most stressful period of my life. We were both done with clients.","time-to-give-up#Time to Give Up?":"And that was my game development journey in my twenties. Now, more than a year has passed since my last production.\nI have a job thanks to my small Twitter following, selling digital products and Blender courses online. I don’t make a ton of money, but it’s enough to get by.\nI recently turned thirty, and that passion I had for game development as a teenager hasn’t changed a bit. I still want to make games, but this time, I want it all! I want to make the art, the code, the design, and the sound, everything!\nAfter all, this is why I love video games.\n“Videogames are the sum total of every expressive medium of all times. Made interactive!” - Phil Fish","whats-next#What\u0026rsquo;s Next?":"So, what’s the plan now? Obviously, I’m starting a blog. I still don’t have all the skills to be a solo developer yet, so I’ll need to learn.\nThis blog is a place to document my journey. For myself, to look back on in five years, and for others to follow right now.\nIf you want to support me and my dream of becoming a full-time indie developer, you can just follow me on my socials. Thank you for reading, and I’ll see you in the next blog post."},"title":"I failed at game dev in my 20s, now what?"},"/blog/i-miss-the-old-internet/":{"data":{"":"We went from personal websites, blogs, and forums to centralized platforms, algorithms, ads, and corporations.\nI miss the old internet.\nAs a kid, I was amazed by the web. I could talk to people from all over the world, learn new things, play games, watch videos, and listen to music, it was magical.\nNow, it’s all about private platforms whose only goal is to make money by keeping you endlessly scrolling.\nBut it’s not all lost! We are seeing the rise of the “indie web” where people are creating their own websites and blogs again. It’s a small movement, but it’s growing.\nI think it’s important to have a place online that you actually own. A space where you can share your thoughts and ideas without worrying about algorithms or corporate oversight.\nThat’s why I created this website. It’s a place where I can share my ideas with the world, and most importantly, a place where I can just be myself."},"title":"I miss the old internet..."},"/glossary":{"data":{},"title":"Glossary"}}